In [1]:
import pandas as pd
import numpy as np
pd.set_option('mode.chained_assignment', None)

#### Q.1 Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

In [2]:
df = pd.read_csv('housingdata.csv')

In [3]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [4]:
df.iloc[0:6,:]
#df.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

#### Q.2 Display the column names and row index in separate cells

In [5]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [6]:
list01 = df.columns

In [7]:
list01

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

#### Q.3 a) How many numbers of “STATE” exist in the dataset. Hint: use shape
####        b) How many unique states exist in the dataset

In [8]:
print("Numbers Of State: ",df['STATE'].shape[0])

Numbers Of State:  9

In [9]:
# b) Method One Using Sets Properties
list02 = df['STATE']
set01 = set(list02)
print("Number Of Unique State: ", len(set01))

Number Of Unique State:  6

In [10]:
# b) Method Two Using nUnique Properties
print("Number Of Unique State: ",df['STATE'].nunique())

Number Of Unique State:  6

#### Q.4 Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [11]:
df.isnull()

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

#### Q.5 Drop all rows with N/A,NA,na values in Num_Bedrooms

In [12]:
df['NUM_BEDROOMS'] = df['NUM_BEDROOMS'].replace('na',np.nan)
df = df.dropna(subset=['NUM_BEDROOMS'])
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

#### Q.6 Replace the NaN and String entries in Num_Bath with previous entry

In [13]:
df.loc[df.NUM_BATH == 'HURLEY'] = np.nan
df.loc[:,'NUM_BATH'].fillna(method='ffill', inplace=True)
df

           PID        STATE        PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654.0            3        1  1000
1  100002000.0  MAHARASHTRA      21325.0            3      1.5    --
3  100004000.0           TN     321321.0            1      1.5   700
4          NaN           TN  589465645.0            3        2  1600
6          NaN          NaN          NaN          NaN        2   NaN
7  100008000.0           HP      23131.0            1        1   NaN

#### Q.7 Replace the empty values in “SQ_FT” with the mean of the all entries.

In [14]:
df['SQ_FT'] = df['SQ_FT'].replace('--',np.nan)
df['SQ_FT'].fillna(pd.to_numeric(df['SQ_FT']).mean(),inplace=True)
df

           PID        STATE        PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654.0            3        1  1000
1  100002000.0  MAHARASHTRA      21325.0            3      1.5  1100
3  100004000.0           TN     321321.0            1      1.5   700
4          NaN           TN  589465645.0            3        2  1600
6          NaN          NaN          NaN          NaN        2  1100
7  100008000.0           HP      23131.0            1        1  1100

#### Q.8 What is the sum of SQ_FT of all entries in the dataset.

In [15]:
print("Sum Of SQ_FT: ",pd.to_numeric(df['SQ_FT']).sum())

Sum Of SQ_FT:  6600.0

#### Q.9 Add a new column “NUM_STORE” and with all the values as 1 for all rows

In [16]:
df['NUM_STORE'] = [1 for i in range(len(df))]
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654.0,3,1,1000,1
1,100002000.0,MAHARASHTRA,21325.0,3,1.5,1100,1
3,100004000.0,TN,321321.0,1,1.5,700,1
4,NaN,TN,589465645.0,3,2,1600,1
6,NaN,NaN,NaN,NaN,2,1100,1
7,100008000.0,HP,23131.0,1,1,1100,1

#### Q.10 Create a DataFrame containing all entries of TN state only

In [17]:
newDF1 = df[df['STATE']=='TN']
newDF1

           PID STATE        PRICE NUM_BEDROOMS NUM_BATH SQ_FT  NUM_STORE
3  100004000.0    TN     321321.0            1      1.5   700          1
4          NaN    TN  589465645.0            3        2  1600          1

#### Q.11 Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [18]:
newDF2 = df[pd.to_numeric(df['SQ_FT']) > 1000]
newDF2

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325.0,3,1.5,1100,1
4,NaN,TN,589465645.0,3,2,1600,1
6,NaN,NaN,NaN,NaN,2,1100,1
7,100008000.0,HP,23131.0,1,1,1100,1

#### Q.12 Create a DataFrame having only first Three columns and First Three rows

In [19]:
newDF3 = df.iloc[0:3,0:3]
newDF3

           PID        STATE     PRICE
0  100001000.0           MP  321654.0
1  100002000.0  MAHARASHTRA   21325.0
3  100004000.0           TN  321321.0

#### Q.13 Display the state having highest average price per square foot of housing area. Hint: Average of (TotalPrice/Sq_Ft)

In [20]:
df['PRICE'] = pd.to_numeric(df.loc[:,'PRICE'])
df['SQ_FT'] = pd.to_numeric(df.loc[:,'SQ_FT'])

df['STATE'][list(map(lambda m,n: m/n,df['PRICE'],df['SQ_FT'])).index(max(list(map(lambda m,n: m/n,df['PRICE'],df['SQ_FT']))))]

'TN'